04_Simulation/PH_Cases/Mesh_200_by_160/steadyState_2D_Baseline_RANS_SST/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(6.6993512e-16 -3.0999138e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(6.6693736e-16 -3.0999994e-16 -1.9273813e-31 6.6666667e-16 -0 6.6666667e-16)
(6.4964812e-16 -3.0976634e-16 -1.9247842e-31 6.6666667e-16 -0 6.6666667e-16)
(6.1838485e-16 -3.0811432e-16 -9.5748757e-32 6.6666667e-16 -0 6.6666667e-16)
(5.747452e-16 -3.0310926e-16 -9.457894e-32 6.6666667e-16 -0 6.6666667e-16)
(5.2242311e-16 -2.9274033e-16 -9.1248427e-32 6.6666667e-16 -0 6.6666667e-16)
(4.67815e-16 -2.7627705e-16 -8.6554309e-32 6.6666667e-16 -0 6.6666667e-16)
(4.2095704e-16 -2.5673603e-16 -0 6.6666667e-16 -0 6.6666667e-16)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0 0 -0 0);
    }
    hills
    {
        type            fixedValue;
        value           uniform (0 -0 -0 0 -0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
