04_Simulation/PH_Cases/Mesh_200_by_160/steadyState_2D_Baseline_RANS_SST/0/wallGradU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallGradU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(3.4374031 -0 -0)
(3.4376347 -0 -0)
(3.4365387 -0 -0)
(3.4322639 -0 -0)
(3.4230675 -0 -0)
(3.4074883 -0 -0)
(3.3846162 -0 -0)
(3.3546 -0 -0)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(3.4374588 -0 -0)
(3.4376531 -0 -0)
(3.438209 -0 -0)
(3.444201 -0 -0)
(3.465619 -0 -0)
(3.5158463 -0 -0)
(3.6073018 -0 -0)
(3.732126 -0 -0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
