04_Simulation/PH_Cases/Mesh_200_by_160/steadyState_2D_Baseline_RANS_SST/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(-0.00032443634 0 0)
(-0.00032445819 0 0)
(-0.00032435475 1.7807055e-22 0)
(-0.00032395128 1.7784914e-22 0)
(-0.00032308328 -1.7737291e-22 0)
(-0.00032161285 0 0)
(-0.00031945409 -5.2559341e-19 -3.2657628e-34)
(-0.00031662104 5.2093223e-19 1.2947253e-33)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(-0.0003244446 5.7011943e-07 -1.4071958e-26)
(-0.00032445995 4.7220193e-08 4.4037862e-23)
(-0.00032459397 -2.9692081e-06 -2.7674663e-21)
(-0.00032573909 -8.4382049e-06 -3.9367166e-21)
(-0.00032955001 -1.616122e-05 -7.5642032e-21)
(-0.00033816984 -2.5692132e-05 -1.1970775e-20)
(-0.00035348511 -3.6159628e-05 -1.6992661e-20)
(-0.00037413099 -4.5718518e-05 -0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
